Tutorial4/SquaredSingle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          42240;
        startFace       1960107;
    }
    drafttube
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          19735;
        startFace       2002347;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120918;
        startFace       2022082;
    }
)

// ************************************************************************* //
